<?php
// +----------------------------------------------------------------------
// | BadouAdmin [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2018 http://badouadmin.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: badouDev <877732602@qq.com>
// +----------------------------------------------------------------------
// | Original reference: https://gitee.com/lande_admin/badouadmin
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// |  权限管理验证类
// +----------------------------------------------------------------------
namespace app\admin\validate;

use \think\Validate;
/**
 * 角色组验证器
 */
class AuthGroup extends Validate
{
    //定义验证规则
    protected $rule = [
        'name' => 'require',

    ];

    //定义验证提示
    protected $message = [
        'name.require' => '用户组名称不得为空',

    ];

    //定义验证场景
    protected $scene = [

    ];
}